---
kind: other
id: Methods.T:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel
source: html/a865ff7e-19d1-b63a-43b4-66f6fbda009d.htm
---
# AlignmentStationLabel Methods

Creates an AlignmentStationLabel object along with its underlying SpotDimension element.
 Returns null if element creation fails.